<a href="https://colab.research.google.com/github/dm-fedorov/pandas_basic/blob/master/кейсы%20по%20анализу%20данных/Загрузка_данных.ipynb"><img align="left" src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open in Colab" title="Open and Execute in Google Colaboratory" target="_blank"></a>

In [6]:
import numpy as np
import pandas as pd

import datetime
from datetime import datetime, date

## Слияние данных

Это наши клиенты:

In [7]:
customers = {'CustomerID': [10, 11],
             'Name': ['Mike', 'Marcia'],
             'Address': ['Address for Mike',
                         'Address for Marcia']}
customers = pd.DataFrame(customers)
customers

   CustomerID    Name             Address
0          10    Mike    Address for Mike
1          11  Marcia  Address for Marcia

Это наши заказы, сделанные клиентами, они связаны с клиентами с помощью столбца CustomerID:

In [8]:
orders = {'CustomerID': [10, 11, 10],
          'OrderDate': [date(2014, 12, 1),
                        date(2014, 12, 1),
                        date(2014, 12, 1)]}
orders = pd.DataFrame(orders)
orders

   CustomerID   OrderDate
0          10  2014-12-01
1          11  2014-12-01
2          10  2014-12-01

Выполняем слияние датафреймов customers и orders так, чтобы мы могли отправить товары:

In [9]:
customers.merge(orders)

   CustomerID    Name             Address   OrderDate
0          10    Mike    Address for Mike  2014-12-01
1          10    Mike    Address for Mike  2014-12-01
2          11  Marcia  Address for Marcia  2014-12-01

Создаем данные, которые будем использовать в качестве примеров в оставшейся части этого раздела:

In [30]:
left_data = {'key1': ['a', 'b', 'c'], 
            'key2': ['x', 'y', 'z'],
            'lval1': [ 0, 1, 2]}
left_data

{'key1': ['a', 'b', 'c'], 'key2': ['x', 'y', 'z'], 'lval1': [0, 1, 2]}

In [31]:
right_data = {'key1': ['a', 'b', 'c'],
              'key2': ['x', 'a', 'z'], 
              'rval1': [ 6, 7, 8 ]}
right_data

{'key1': ['a', 'b', 'c'], 'key2': ['x', 'a', 'z'], 'rval1': [6, 7, 8]}

In [10]:
left = pd.DataFrame(left_data, index=[0, 1, 2])
left

  key1 key2  lval1
0    a    x      0
1    b    y      1
2    c    z      2

In [11]:
right = pd.DataFrame(right_data, index=[1, 2, 3])
right

  key1 key2  rval1
1    a    x      6
2    b    a      7
3    c    z      8

Демонстрируем слияние, не указывая столбцы, по которым нужно выполнить слияние этот программный код неявно выполняет слияние по всем общим столбцам:

In [13]:
left.merge(right)

  key1 key2  lval1  rval1
0    a    x      0      6
1    c    z      2      8

Демонстрируем слияние, явно задав столбец, по значениям которого нужно связать объекты DataFrame:

In [15]:
left.merge(right, on='key1')

  key1 key2_x  lval1 key2_y  rval1
0    a      x      0      x      6
1    b      y      1      a      7
2    c      z      2      z      8

Явно выполняем слияние с помощью двух столбцов:

In [17]:
left.merge(right, on=['key1', 'key2'])

  key1 key2  lval1  rval1
0    a    x      0      6
1    c    z      2      8

Соединяем индексы строк обеих матриц:

In [19]:
pd.merge(left, right, left_index=True, right_index=True)

  key1_x key2_x  lval1 key1_y key2_y  rval1
1      b      y      1      a      x      6
2      c      z      2      b      a      7

## Настройка семантики соединения при выполнении слияния

Внешнее соединение возращает все строки из внутреннего соединения, а также строки датафреймов left и right, не попавшие во внутреннее соединение отсутствующие элементы заполняются значениями NaN:

In [21]:
left.merge(right, how='outer')

  key1 key2  lval1  rval1
0    a    x    0.0    6.0
1    b    y    1.0    NaN
2    c    z    2.0    8.0
3    b    a    NaN    7.0

Левое соединение возращает все строки из внутреннего соединения,  а также строки датафрейма left, не попавшие во внутреннее соединение.  
Отсутствующие элементы заполняются значениями NaN. 
Итоговый датафрейм содержит общие строки датафреймов left и right с метками 0 и 2 (строки датафреймов left и right, у которых совпали значения в общих столбцах key1 и key2), а также уникальную строку датафрейма left с меткой 1.
Уникальная строка датафрейма left в итоговом датафрейме в столбце rval1 заполняется значением NaN, потому что в датафрейме left этот столбец отсутствовал:

In [23]:
left.merge(right, how='left')

  key1 key2  lval1  rval1
0    a    x      0    6.0
1    b    y      1    NaN
2    c    z      2    8.0

Правое соединение возращает все строки из внутреннего соединения, а также строки датафрейма right, не попавшие во внутреннее соединение. 
Отсутствующие элементы заполняются значениями NaN. 
Итоговый датафрейм содержит общие строки датафреймов left и right с метками 0 и 1 (строки датафреймов left и right, у которых совпали значения в общих столбцах key1 и key2), а также уникальную строку датафрейма right с меткой 2.
Уникальная строка датафрейма right в итоговом датафрейме в столбце lval1 заполняется значением NaN, потому что в датафрейме right этот столбец отсутствовал:

In [25]:
left.merge(right, how='right')

  key1 key2  lval1  rval1
0    a    x    0.0      6
1    b    a    NaN      7
2    c    z    2.0      8

Соединяем left с right (метод по умолчанию - outer) и поскольку эти объекты имеют дублирующиеся имена столбцов мы задаем параметы lsuffix и rsuffix:

In [27]:
left.join(right, lsuffix='_left', rsuffix='_right')

  key1_left key2_left  lval1 key1_right key2_right  rval1
0         a         x      0        NaN        NaN    NaN
1         b         y      1          a          x    6.0
2         c         z      2          b          a    7.0

Соединяем left с right с помощью внутреннего соединения:

In [29]:
left.join(right, lsuffix='_left', rsuffix='_right', how='inner')

  key1_left key2_left  lval1 key1_right key2_right  rval1
1         b         y      1          a          x      6
2         c         z      2          b          a      7